{
  "home": "الرئيسية",
  "about": "من نحن",
  "courses": "الدورات",
  "registration": "التسجيل",
  "blog": "المدونة",
  "contact": "اتصل بنا",
  "exams": "الامتحانات",
  "switch_to_ar": "عربي",
  "switch_to_en": "English",
  "academy_name": "أكاديمية العلا",
  "slogan": "ارفع مستوى إنجليزيتك",
  "hero_welcome": "مرحبا بكم في أكاديمية العلا",
  "hero_description": "تعليم الإنجليزية الاحترافي لجميع المستويات.",
  "quick_links_courses": "عرض الدورات",
  "quick_links_contact": "اتصل بنا",
  "testimonials_title": "ما يقوله طلابنا",
  "explore_academy": "استكشف أكاديميتنا",
  "about_mission": "مهمتنا: توفير تعليم إنجليزي عالي الجودة.",
  "about_mission_description": "كصاحب أكاديمية العلا، أنا ملتزم بتوفير تعليم إنجليزي عالي الجودة يغير الحياة. مهمتي هي تقديم دورات مبتكرة ومناسبة لكل متعلم، من المبتدئين إلى المتقدمين. مع الإرشاد الشخصي والطرق الممتعة، أسعى لبناء مجتمع يفتح الثقة باللغة الإنجليزية أبواب الفرص العالمية—ابدأ معنا الآن!",
  "about_vision": "رؤيتنا: تمكين الطلاب من التواصل عالميًا.",
  "about_vision_description": "أتخيل أكاديمية العلا كمنارة للتمكين، حيث أساعد كل طالب على التواصل عالميًا بسهولة. كصاحب مكرس، أهدف إلى كسر حواجز اللغة، مقدمًا تعليمًا متطورًا يلهم التعلم مدى الحياة. هدفي هو خلق مجتمع مزدهر من المتحدثين الواثقين، وأنا متحمس لقيادة هذه الرحلة معك خطوة بخطوة!",
  "about_team": "فريقنا",
  "about_why_choose": "لماذا تختارنا؟",
  "courses_title": "دوراتنا",
  "courses_subtitle": "اختر دورة تناسب أهدافك وجدولك الزمني.",
  "courses_description": "استكشف دورات الإنجليزية المتنوعة لجميع المستويات والأعمار.",
  "registration_title": "سجل الآن",
  "registration_form_name": "الاسم",
  "registration_form_email": "البريد الإلكتروني",
  "registration_form_phone": "الهاتف",
  "registration_form_course": "الدورة المفضلة",
  "registration_form_message": "الرسالة",
  "registration_submit": "إرسال",
  "blog_title": "المدونة والموارد",
  "contact_title": "اتصل بنا",
  "contact_us": "اتصل بنا",
  "contact_form_name": "الاسم",
  "contact_form_email": "البريد الإلكتروني",
  "contact_form_message": "الرسالة",
  "contact_submit": "إرسال",
  "contact_phone": "الهاتف: +249924357822",
  "contact_email": "البريد: ola.academy1212@gmail.com",
  "contact_whatsapp": "واتساب",
  "exams_title": "نظام الامتحانات",
  "exams_start": "ابدأ الامتحان",
  "exams_score": "درجاتك",
  "footer_rights": "جميع الحقوق محفوظة.",
  "general_english": "الإنجليزية العامة",
  "business_english": "الإنجليزية التجارية",
  "ielts_prep": "تحضير آيلتس",
  "kids_english": "إنجليزية الأطفال",
  "course_description": "الوصف",
  "course_level": "المستوى",
  "course_duration": "المدة",
  "course_price": "السعر",
  "course_enroll": "سجل الآن",
  "course_enroll_alert": "ميزة التسجيل قادمة قريبًا! تواصل معنا على info@elolaacademy.com.",
  "course_inquiry": "استفسار",
  "enroll_fullname_placeholder": "الاسم الكامل",
  "enroll_country_placeholder": "البلد",
  "enroll_nationality_placeholder": "الجنسية",
  "enroll_email_placeholder": "البريد الإلكتروني",
  "enroll_submit": "إرسال التسجيل",
  "enroll_thankyou": "شكراً لتقديم تسجيلك! سيتواصل معك فريق الخدمات الطلابية قريباً عبر البريد الإلكتروني بشأن عملية التسجيل.",
  "enroll_error": "فشل الإرسال. حاول مرة أخرى.",
  "blog_post1_title": "نصائح لتعليم الإنجليزية اليومية في أكاديمية العلا",
  "blog_post1_content": "كصاحب فخور لأكاديمية العلا، أنا شغوف بمساعدة الطلاب على إتقان الإنجليزية اليومية. سواء كنت مبتدئًا أو ترغب في تحسين مهاراتك، فإن دورة الإنجليزية العامة لدينا مصممة لجعل التعلم ممتعًا وفعالًا. في هذا المقال، سأشارك بعض النصائح الرئيسية لتبدأ رحلتك نحو الطلاقة.\n\nأولاً، اغمر نفسك في اللغة. استمع إلى بودكاست إنجليزي، شاهد أفلامًا بدون ترجمة، أو اقرأ كتبًا بسيطة. في أكاديمية العلا، تتضمن دروسنا التفاعلية سيناريوهات حياة حقيقية لتسهيل ذلك. ثانيًا، مارس التحدث يوميًا. ابحث عن شريك لغة أو انضم إلى نوادينا الحوارية لبناء الثقة. ثالثًا، ركز على المفردات. تعلم 5-10 كلمات جديدة يوميًا واستخدمها في جمل. دوراتنا تشمل تعليقات شخصية لمساعدتك على تذكرها. رابعًا، حدد أهدافًا صغيرة. تابع تقدمك باختبارات أسبوعية، مثل برنامجنا الذي يدوم 3 أشهر. أخيرًا، كن متسقًا. خصص وقتًا يوميًا، وستلاحظ النتائج.\n\nهل أنت جاهز للغوص؟ سجل في دورة الإنجليزية العامة اليوم وغير مهاراتك اللغوية!",
  "blog_post2_title": "إتقان الإنجليزية التجارية: مهارات أساسية للمحترفين",
  "blog_post2_content": "مرحبًا من أكاديمية العلا! كصاحب، لاحظت كيف يمكن أن تطور مهارات الإنجليزية التجارية القوية المهن. دورة الإنجليزية التجارية لدينا مصممة للمتعلمين المتوسطين ليتميزوا في البيئات المهنية. إليك بعض النصائح الأساسية للتقدم.\n\nابدأ بمفردات الأعمال. تعلم مصطلحات مثل 'العائد على الاستثمار'، 'الأطراف المعنية'، و'العرض التقديمي'. دوراتنا تشمل وحدات متخصصة بالصناعة. ثم، مارس العروض التقديمية. سجل نفسك وراجع الوضوح والثقة—مدربونا يقدمون تعليقات خبيرة. بعد ذلك، أتقن آداب البريد الإلكتروني. استخدم لغة مهذبة وهيكل واضح؛ نغطي هذا بعمق. كذلك، تحسن الاستماع في الاجتماعات. مارس مع محاكاة صوتية من برنامجنا. أخيرًا، انشئ شبكة علاقات بالإنجليزية. احضر فعاليات أو استخدم LinkedIn للتواصل.\n\nلا تفوت الفرصة—انضم إلى دورة الإنجليزية التجارية التي تمتد لمدة 2 شهر واحصل على الميزة التي تحتاجها!",
  "blog_post3_title": "استراتيجيات تحضير آيلتس: نجح في امتحانك مع أكاديمية العلا",
  "blog_post3_content": "تحية من أكاديمية العلا! كصاحب، أعلم كيف يكون آيلتس حاسمًا لمستقبلك. دورة تحضير آيلتس لدينا مصممة للمتعلمين المتقدمين لتحقيق درجات عالية. دعنا نستكشف بعض الاستراتيجيات المثبتة.\n\nأولاً، افهم تنسيق الاختبار. تعرف على أقسام الاستماع، القراءة، الكتابة، والمحادثة—دوراتنا تشمل اختبارات تجريبية. ثانيًا، ابن مفرداتك. ركز على الكلمات الأكاديمية؛ نوفر تمارين يومية. ثالثًا، مارس إدارة الوقت. قم بمحاكاة ظروف الامتحان لتحسين السرعة. رابعًا، صقل مهارات المحادثة. سجل الردود واحصل على تعليقات من خبرائنا. خامسًا، تحلل الأخطاء. راجع الاختبارات التجريبية لتجنب التكرار.\n\nسجل في دورة تحضير آيلتس اليوم التي تمتد لمدة شهر واحصل على خطوة أقرب لأهدافك!",
  "blog_post4_title": "طرق ممتعة لتعليم الإنجليزية للأطفال في أكاديمية العلا",
  "blog_post4_content": "مرحبًا بكم! كصاحب أكاديمية العلا، أنا متحمس لدورة الإنجليزية للأطفال. إنها تركز على جعل التعلم ممتعًا للمبتدئين. إليك بعض الطرق الإبداعية لتعليم الإنجليزية للأطفال.\n\nاستخدم ألعابًا مثل 'قلد سايمون' أو بينجو لتعليم المفردات. دوراتنا تضم أنشطة تعتمد على اللعب. غنِ الأغاني—القوافي تساعد على النطق والذاكرة. اقرأ كتبًا مصورة معًا لبناء مهارات القصص. اصنع حرفًا يدوية مع ملصقات إنجليزية لتعزيز الكلمات. أخيرًا، كافئ التقدم بملصقات للحفاظ على التحفيز.\n\nأعطِ طفلك بداية مبهجة—سجل في دورة الإنجليزية للأطفال التي تمتد لمدة 4 أشهر الآن!",
  "blog_date": "نشر في",
  "blog_subtitle": "ابقَ على اطلاع بأحدث النصائح، القصص، والموارد لرحلتك في تعلم الإنجليزية.",
  "blog_description": "استكشف أحدث المقالات والبصائر حول تعلم الإنجليزية والتعليم.",
  "about_description": "اكتشف قصة أكاديمية العلا، مهمتنا لتمكين المتعلمين، ولماذا نبرز في تعليم الإنجليزية.",
  "about_social_contact": "تواصل معنا عبر وسائل التواصل الاجتماعي",
  "team_member1_name": "علا علي الجيلي",
  "team_member1_bio": "الرئيس التنفيذي للأكاديمية، يقود برؤية لثورة تعليم الإنجليزية من خلال استراتيجيات مبتكرة والتفاني.",
  "team_member2_name": "فاطمة حسن",
  "team_member2_bio": "مدرّسة إنجليزية كبيرة بـ12 عامًا من الخبرة، متخصصة في القواعد المتقدمة ومهارات الكتابة.",
  "team_member3_name": "محمد إسماعيل",
  "team_member3_bio": "مطور منهج دراسي يركز على التعلم التفاعلي، يجلب 8 سنوات من خبرة تصميم التعليم.",
  "why_choose1": "مدرسون مؤهلون بدرجة عالية",
  "why_choose2": "طرق تدريس مبتكرة",
  "why_choose3": "جداول تعلم مرنة",
  "why_choose4": "قصص نجاح الطلاب المثبتة",
  "contact_description": "تواصل مع أكاديمية العلا للاستفسارات والدعم.",
  "contact_form_label": "نموذج التواصل",
  "contact_required": "هذا الحقل مطلوب",
  "contact_invalid_email": "يرجى إدخال بريد إلكتروني صالح",
  "contact_success": "شكراً! تم إرسال رسالتك بنجاح. سيتواصل معك فريق الخدمات الطلابية قريباً.",
  "contact_error": "فشل إرسال الرسالة. حاول مرة أخرى لاحقاً.",
  "contact_submitting": "جارٍ الإرسال...",
  "contact_map": "خريطة موقع الأكاديمية",
  "contact_us_button": "تبديل خيارات التواصل",
  "general_english_placement_test": "اختبار تحديد مستوى الإنجليزية العامة",
  "general_english_placement_test_description": "اختبر إتقانك للإنجليزية عبر القواعد، المفردات، والفهم لجميع المستويات.",
  "business_english_assessment": "تقييم الإنجليزية التجارية",
  "business_english_assessment_description": "قيّم مهاراتك في التواصل التجاري، بما في ذلك الكتابة والمصطلحات المهنية.",
  "ielts_preparation_practice_test": "اختبار تجريبي لتحضير آيلتس",
  "ielts_preparation_practice_test_description": "اختبار تجريبي مصمم لمحاكاة ظروف آيلتس مع أقسام القراءة، الكتابة، والاستماع.",
  "kids_english_fun_quiz": "مسابقة ممتعة للإنجليزية للأطفال",
  "kids_english_fun_quiz_description": "مسابقة ممتعة لاختبار المهارات الأساسية في الإنجليزية مع أسئلة مناسبة للأعمار.",
  "general_english_description": "المستوى: من المبتدئ إلى المتقدم\nالمدة: 3 أشهر",
  "business_english_description": "المستوى: متوسط\nالمدة: 2 شهر",
  "ielts_prep_description": "المستوى: متقدم\nالمدة: 1 شهر",
  "kids_english_description": "المستوى: مبتدئ\nالمدة: 4 أشهر",
  "exam_question": "السؤال",
  "submit_answers": "إرسال الإجابات",
  "general_english_description": "انغمس في اللغة الإنجليزية اليومية مع دروسنا التفاعلية! مثالي لجميع المستويات من المبتدئين إلى المتقدمين، هذا الكورس يقدم أنشطة ممتعة، محادثات واقعية، وتغذية راجعة مخصصة لتعزيز ثقتك بنفسك. هل أنت مستعد لتطوير مهاراتك اللغوية؟ انضم إلينا اليوم وابدأ رحلتك نحو الطلاقة!",
  "business_english_description": "افتح آفاقك المهنية مع كورس الإنجليزية للأعمال! مصمم للمتعلمين في المستوى المتوسط، هذا البرنامج يزوّدك بالمهارات اللازمة للتفوق في الاجتماعات، المفاوضات، والعروض التقديمية. احصل على ميزة تنافسية في مسيرتك المهنية — سجّل الآن وابدأ خطوتك الأولى نحو النجاح!",
  "ielts_prep_description": "حقق حلمك في الحصول على أعلى درجات IELTS مع كورس التحضير الموجه! مُخصص للمتعلمين المتقدمين، هذا البرنامج يوفر استراتيجيات فعّالة، اختبارات تدريبية، وتوجيه شخصي لزيادة فرص نجاحك. لا تؤجل — سجّل الآن ومهّد طريقك للنجاح الأكاديمي أو المهني!",
  "kids_english_description": "أطلق شغف طفلك باللغة الإنجليزية مع كورس الأطفال الممتع والتفاعلي! مثالي للصغار المبتدئين، هذا البرنامج يحتوي على ألعاب، أغاني، وأنشطة إبداعية تجعل التعلم ممتعاً. امنح طفلك بداية قوية — سجّل الآن وشاهد تقدمه في تعلم لغة جديدة!",
  
  "testimonials_title": "آراء طلابنا",
  "testimonial_fatima_name": "فاطمة أحمد (السودان)",
  "testimonial_fatima_quote": "كورس الإنجليزية العامة غيّر مهاراتي في التواصل اليومي. الدروس التفاعلية والتغذية الراجعة كانت رائعة!",
  "testimonial_mohammed_name": "محمد علي (مصر)",
  "testimonial_mohammed_quote": "الإنجليزية للأعمال في أكاديمية العُلا زادت ثقتي في المواقف المهنية. تدريب كتابة الإيميلات كان نقطة تحول!",
  "testimonial_sara_name": "سارة آل سعود (السعودية)",
  "testimonial_sara_quote": "كورس التحضير لـ IELTS جهزني بشكل مثالي للامتحان. الاختبارات التجريبية والتوجيه الخبير ساعدوني في الحصول على درجة عالية!",
  "testimonial_omar_name": "عمر حسن (السودان)",
  "testimonial_omar_quote": "طفلي استمتع كثيراً بكورس الإنجليزية للأطفال! الألعاب والأغاني جعلت التعلم ممتعاً ومشوقاً — أنصح به بشدة!",
  "testimonial_layla_name": "ليلى إبراهيم (مصر)",
  "testimonial_layla_quote": "طوّرت مستواي العام في اللغة الإنجليزية مع كورس الإنجليزية العامة. نوادي المحادثة كانت طريقة رائعة للتدريب!",
  
  "review_title": "أضف تقييمك",
  "review_form_title": "شارك تجربتك",
  "review_form_name": "اسمك",
  "review_form_name_placeholder": "أدخل اسمك الكامل",
  "review_form_course": "الكورس الذي درسته",
  "review_form_course_placeholder": "اختر كورساً",
  "review_form_review": "تقييمك",
  "review_form_review_placeholder": "اكتب ملاحظاتك هنا...",
  "review_form_submit": "إرسال التقييم",
  "review_error_required": "جميع الحقول مطلوبة.",
  "review_success": "شكراً لك! تم إرسال تقييمك بنجاح.",
  "no_reviews": "لا توجد تقييمات بعد. كن أول من يشارك تجربته!"
}
