{
  "home": "Home",
  "about": "About Us",
  "courses": "Courses",
  "registration": "Registration",
  "blog": "Blog",
  "contact": "Contact Us",
  "exams": "Exams",
  "switch_to_ar": "عربي",
  "switch_to_en": "English",
  "academy_name": "El Ola Academy",
  "slogan": "Elevate Your English",
  "hero_welcome": "Welcome to El Ola Academy",
  "hero_description": "Professional English education for all levels.",
  "quick_links_courses": "View Courses",
  "quick_links_contact": "Contact Us",
  "testimonials_title": "What Our Students Say",
  "explore_academy": "Explore Our Academy",
  "about_mission": "Our Mission: Providing high-quality English education.",
  "about_mission_description": "As the owner of El Ola Academy, I am committed to providing high-quality English education that transforms lives. My mission is to offer accessible, innovative courses tailored to every learner’s needs, from beginners to advanced students. With personalized guidance and engaging methods, I strive to build a community where confidence in English opens doors to global opportunities—starting right here with you!",
  "about_vision": "Our Vision: Empowering students to communicate globally.",
  "about_vision_description": "I envision El Ola Academy as a beacon of empowerment, where I help every student communicate globally with ease. As your dedicated owner, I aim to break down language barriers, delivering cutting-edge education that inspires lifelong learning. My goal is to create a thriving community of confident speakers, and I’m excited to lead this journey with you every step of the way!",
  "about_team": "Our Team",
  "about_why_choose": "Why Choose Us?",
  "courses_title": "Our Courses",
  "courses_subtitle": "Choose a course that fits your learning goals and schedule.",
  "courses_description": "Explore our diverse English courses for all levels and ages.",
  "registration_title": "Register Now",
  "registration_form_name": "Name",
  "registration_form_email": "Email",
  "registration_form_phone": "Phone",
  "registration_form_course": "Course of Interest",
  "registration_form_message": "Message",
  "registration_submit": "Submit",
  "blog_title": "Blog & Resources",
  "contact_title": "Contact Us",
  "contact_us": "Contact Us",
  "contact_form_name": "Name",
  "contact_form_email": "Email",
  "contact_form_message": "Message",
  "contact_submit": "Submit",
  "contact_phone": "Phone: +249924357822",
  "contact_email": "Email: ola.academy1212@gmail.com",
  "contact_whatsapp": "WhatsApp",
  "exams_title": "Exam System",
  "exams_start": "Start Exam",
  "exams_score": "Your Score",
  "footer_rights": "All rights reserved.",
  "general_english": "General English",
  "business_english": "Business English",
  "ielts_prep": "IELTS Preparation",
  "kids_english": "Kids English",
  "course_description": "Description",
  "course_level": "Level",
  "course_duration": "Duration",
  "course_price": "Price",
  "course_enroll": "Enroll Now",
  "course_enroll_alert": "Registration feature coming soon! Contact us at info@elolaacademy.com.",
  "course_inquiry": "Inquiry",
  "enroll_fullname_placeholder": "Full Name",
  "enroll_country_placeholder": "Country",
  "enroll_nationality_placeholder": "Nationality",
  "enroll_email_placeholder": "Email",
  "enroll_submit": "Submit Enrollment",
  "enroll_thankyou": "Thank you for submitting your enrollment! Our student services will contact you soon via email regarding your enrollment process.",
  "enroll_error": "Failed to submit. Please try again.",
  "blog_post1_title": "Tips for Learning Everyday English at El Ola Academy",
  "blog_post1_content": "As the proud owner of El Ola Academy, I’m passionate about helping students master everyday English. Whether you're a beginner or looking to refine your skills, our General English course is designed to make learning fun and effective. In this post, I'll share some top tips to get you started on your journey to fluency.\n\nFirst, immerse yourself in the language. Listen to English podcasts, watch movies without subtitles, or read simple books. At El Ola Academy, our interactive lessons incorporate real-life scenarios to make this easy. Second, practice speaking daily. Find a language partner or join our conversation clubs to build confidence. Third, focus on vocabulary. Learn 5-10 new words each day and use them in sentences. Our course includes personalized feedback to help you remember them. Fourth, set small goals. Track your progress with weekly quizzes, just like in our 3-month program. Finally, stay consistent. Dedicate time each day, and you'll see results.\n\nReady to dive in? Enroll in our General English course today and transform your language skills!",
  "blog_post2_title": "Mastering Business English: Essential Skills for Professionals",
  "blog_post2_content": "Hello from El Ola Academy! As the owner, I've seen how strong Business English skills can advance careers. Our Business English course is tailored for intermediate learners to excel in professional settings. Here are some essential tips to get ahead.\n\nStart with business vocabulary. Learn terms like 'ROI', 'stakeholder', and 'pitch'. Our course includes industry-specific modules. Next, practice presentations. Record yourself and review for clarity and confidence—our instructors provide expert feedback. Then, master email etiquette. Use polite language and clear structure; we cover this in depth. Also, improve listening in meetings. Practice with audio simulations from our program. Lastly, network in English. Attend events or use LinkedIn to connect.\n\nDon't miss out—join our 2-month Business English course and gain the edge you need!",
  "blog_post3_title": "IELTS Preparation Strategies: Ace Your Exam with El Ola Academy",
  "blog_post3_content": "Greetings from El Ola Academy! As the owner, I know how crucial IELTS is for your future. Our IELTS Preparation course is designed for advanced learners to achieve high scores. Let's explore some proven strategies.\n\nFirst, understand the test format. Familiarize yourself with listening, reading, writing, and speaking sections—our course includes mock tests. Second, build vocabulary. Focus on academic words; we provide daily exercises. Third, practice time management. Simulate exam conditions to improve speed. Fourth, refine speaking skills. Record responses and get feedback from our experts. Fifth, analyze mistakes. Review practice tests to avoid repetition.\n\nEnroll in our 1-month IELTS Prep course today and step closer to your goals!",
  "blog_post4_title": "Fun Ways to Teach English to Kids at El Ola Academy",
  "blog_post4_content": "Hi everyone! As the owner of El Ola Academy, I'm excited about our Kids English course. It's all about making learning fun for beginners. Here are some creative ways to teach English to children.\n\nUse games like Simon Says or bingo to teach vocabulary. Our course incorporates play-based activities. Sing songs—rhymes help with pronunciation and memory. Read picture books together to build storytelling skills. Create crafts with English labels to reinforce words. Finally, reward progress with stickers to keep motivation high.\n\nGive your child a joyful start—sign up for our 4-month Kids English course now!",
  "blog_date": "Published on",
  "blog_subtitle": "Stay updated with the latest tips, stories, and resources for your English learning journey.",
  "blog_description": "Explore our latest articles and insights on English learning and education.",
  "about_description": "Discover the story behind El Ola Academy, our mission to empower learners, and why we stand out in English education.",
  "about_social_contact": "Connect With Us on Social Media",
  "team_member1_name": "Ola Ali Algaily",
  "team_member1_bio": "CEO of the academy, leading with a vision to revolutionize English education through innovative strategies and dedication.",
  "team_member2_name": "Fatima Hassan",
  "team_member2_bio": "Senior English instructor with 12 years of experience, specializing in advanced grammar and writing skills.",
  "team_member3_name": "Mohammed Ismail",
  "team_member3_bio": "Curriculum developer with a focus on interactive learning, bringing 8 years of educational design expertise.",
  "why_choose1": "Highly Qualified Instructors",
  "why_choose2": "Innovative Teaching Methods",
  "why_choose3": "Flexible Learning Schedules",
  "why_choose4": "Proven Student Success Stories",
  "contact_description": "Get in touch with El Ola Academy for inquiries and support.",
  "contact_form_label": "Contact Form",
  "contact_required": "This field is required",
  "contact_invalid_email": "Please enter a valid email address",
  "contact_success": "Thank you! Your message has been sent successfully. Our student services will contact you soon.",
  "contact_error": "Failed to send message. Please try again later.",
  "contact_submitting": "Submitting...",
  "contact_map": "Academy Location Map",
  "contact_us_button": "Toggle Contact Us Options",
  "general_english_placement_test": "General English Placement Test",
  "general_english_placement_test_description": "Test your English proficiency across grammar, vocabulary, and comprehension for all levels.",
  "business_english_assessment": "Business English Assessment",
  "business_english_assessment_description": "Evaluate your business communication skills, including writing and professional terminology.",
  "ielts_preparation_practice_test": "IELTS Preparation Practice Test",
  "ielts_preparation_practice_test_description": "Practice exam designed to simulate IELTS conditions with reading, writing, and listening sections.",
  "kids_english_fun_quiz": "Kids English Fun Quiz",
  "kids_english_fun_quiz_description": "Engaging quiz to test basic English skills with fun, age-appropriate questions.",
  "general_english_description": "Level: Beginner to Advanced\nDuration: 3 months",
  "business_english_description": "Level: Intermediate\nDuration: 2 months",
  "ielts_prep_description": "Level: Advanced\nDuration: 1 month",
  "kids_english_description": "Level: Beginner\nDuration: 4 months",
  "exam_question": "Question",
  "submit_answers": "Submit Answers",
  "general_english_description": "Immerse yourself in everyday English with our interactive lessons! Perfect for all levels from beginners to advanced, this course offers fun activities, real-life conversations, and personalized feedback to boost your confidence. Ready to transform your language skills? Join us today and start your journey toward fluency!",
  "business_english_description": "Unlock your professional potential with our Business English course! Designed for intermediate learners, this program equips you with the skills to excel in meetings, negotiations, and presentations. Gain a competitive edge in your career — enroll now and take the first step toward success!",
  "ielts_prep_description": "Achieve your dream IELTS score with our guided preparation course! Tailored for advanced learners, this program provides expert strategies, practice tests, and personalized guidance to maximize your performance. Don’t delay — sign up today and pave your way to academic or professional success!",
  "kids_english_description": "Spark your child’s love for English with our fun and interactive Kids English course! Perfect for young beginners, this program features games, songs, and creative activities to make learning enjoyable. Give your child a head start — enroll today and watch them thrive in a new language!",
  
  "testimonials_title": "What Our Students Say",
  "testimonial_fatima_name": "Fatima Ahmed (Sudan)",
  "testimonial_fatima_quote": "The General English course transformed my daily communication skills. The interactive lessons and personalized feedback were amazing!",
  "testimonial_mohammed_name": "Mohammed Ali (Egypt)",
  "testimonial_mohammed_quote": "Business English at El Ola Academy boosted my confidence in professional settings. The email etiquette training was a game-changer!",
  "testimonial_sara_name": "Sara Al-Saud (Saudi Arabia)",
  "testimonial_sara_quote": "The IELTS Preparation course prepared me perfectly for the exam. The mock tests and expert guidance helped me score high!",
  "testimonial_omar_name": "Omar Hassan (Sudan)",
  "testimonial_omar_quote": "My child loved the Kids English course! The games and songs made learning fun and engaging—highly recommend it!",
  "testimonial_layla_name": "Layla Ibrahim (Egypt)",
  "testimonial_layla_quote": "I improved my overall English with the General English course. The conversation clubs were a fantastic way to practice!",
  
  "review_title": "Leave a Review",
  "review_form_title": "Share Your Experience",
  "review_form_name": "Your Name",
  "review_form_name_placeholder": "Enter your full name",
  "review_form_course": "Course Taken",
  "review_form_course_placeholder": "Select a course",
  "review_form_review": "Your Review",
  "review_form_review_placeholder": "Write your feedback here...",
  "review_form_submit": "Submit Review",
  "review_error_required": "All fields are required.",
  "review_success": "Thank you! Your review has been submitted.",
  "no_reviews": "No reviews yet. Be the first to share your experience!"
}
